---
kind: method
id: M:Autodesk.Revit.DB.Face.GetSurface
source: html/c8d124ed-1e6e-d08c-3e4b-b37c4bc2890b.htm
---
# Autodesk.Revit.DB.Face.GetSurface Method

Returns a copy of this face's surface.

## Syntax (C#)
```csharp
public Surface GetSurface()
```

## Returns
A copy of this face's surface.